changeworld0823/WaterValve/software/Firmware/myPLC.ioc
RCC.IPParameters=ADCFreqValue,ADCPresc,AHBFreq_Value,APB1CLKDivider,APB1Freq_Value,APB1TimFreq_Value,APB2Freq_Value,APB2TimFreq_Value,FCLKCortexFreq_Value,FSMCFreq_Value,FamilyName,HCLKFreq_Value,I2S2Freq_Value,I2S3Freq_Value,MCOFreq_Value,PLLCLKFreq_Value,PLLMCOFreq_Value,PLLMUL,SDIOFreq_Value,SDIOHCLKDiv2FreqValue,SYSCLKFreq_VALUE,SYSCLKSource,TimSysFreq_Value,USBFreq_Value
ProjectManager.AskForMigrate=true
Mcu.Name=STM32F103V(C-D-E)Tx
PE0.Signal=GPIO_Input
Dma.UART4_TX.3.MemInc=DMA_MINC_ENABLE
NVIC.SavedPendsvIrqHandlerGenerated=true
PA2.Signal=USART2_TX
Mcu.IP8=SYS
VP_FREERTOS_VS_CMSIS_V2.Signal=FREERTOS_VS_CMSIS_V2
Mcu.IP9=TIM3
PD14.Signal=GPIO_Output
Mcu.IP6=SPI1
Mcu.IP7=SPI2
ProjectManager.CoupleFile=false
PB3.Signal=SPI1_SCK
RCC.SYSCLKFreq_VALUE=64000000
Dma.USART3_RX.0.Priority=DMA_PRIORITY_LOW
PC5.PinState=GPIO_PIN_SET
KeepUserPlacement=false
PC5.GPIO_Label=TPIC_SRCLR
USART3.VirtualMode=VM_ASYNC
PA15.GPIO_Speed=GPIO_SPEED_FREQ_HIGH
PA14.Signal=SYS_JTCK-SWCLK
Dma.USART1_RX.4.MemInc=DMA_MINC_ENABLE
PE15.GPIO_PuPd=GPIO_PULLUP
PC6.GPIOParameters=GPIO_Label
PA8.GPIO_PuPd=GPIO_PULLUP
ADC1.NbrOfConversionFlag=1
Dma.USART3_TX.1.Direction=DMA_MEMORY_TO_PERIPH
PA15.GPIO_PuPd=GPIO_PULLUP
PA2.Mode=Asynchronous
PB8.Signal=GPIO_Output
PE3.GPIO_Label=MCU_D2_IN
PC8.Locked=true
Dma.USART1_RX.4.PeriphInc=DMA_PINC_DISABLE
PC9.Signal=GPIO_Input
RCC.APB1Freq_Value=32000000
PB8.GPIO_Speed=GPIO_SPEED_FREQ_MEDIUM
PC5.GPIO_ModeDefaultOutputPP=GPIO_MODE_OUTPUT_PP
PE15.PinState=GPIO_PIN_SET
ProjectManager.DeviceId=STM32F103VETx
ProjectManager.LibraryCopy=0
PB0.GPIO_PuPd=GPIO_PULLUP
PD12.GPIO_PuPd=GPIO_PULLUP
PA3.GPIO_Label=MCU_RS232_RXD
PB1.GPIOParameters=GPIO_Speed,PinState,GPIO_PuPd,GPIO_Label,GPIO_ModeDefaultOutputPP
